DECL|I2S_MNVAL_MASK|macro|I2S_MNVAL_MASK
DECL|I2S_MNVAL|macro|I2S_MNVAL
DECL|SSCR0_ACS|macro|SSCR0_ACS
DECL|SSCR0_DSIZE|macro|SSCR0_DSIZE
DECL|SSCR0_DSS_MASK|macro|SSCR0_DSS_MASK
DECL|SSCR0_ECS|macro|SSCR0_ECS
DECL|SSCR0_EDSS|macro|SSCR0_EDSS
DECL|SSCR0_FRDC|macro|SSCR0_FRDC
DECL|SSCR0_FRF|macro|SSCR0_FRF
DECL|SSCR0_MOD|macro|SSCR0_MOD
DECL|SSCR0_MOT|macro|SSCR0_MOT
DECL|SSCR0_NAT|macro|SSCR0_NAT
DECL|SSCR0_NCS|macro|SSCR0_NCS
DECL|SSCR0_PSP|macro|SSCR0_PSP
DECL|SSCR0_RIM|macro|SSCR0_RIM
DECL|SSCR0_SCR_MASK|macro|SSCR0_SCR_MASK
DECL|SSCR0_SCR|macro|SSCR0_SCR
DECL|SSCR0_SSE|macro|SSCR0_SSE
DECL|SSCR0_TIM|macro|SSCR0_TIM
DECL|SSCR0_TI|macro|SSCR0_TI
DECL|SSCR1_EBCEI|macro|SSCR1_EBCEI
DECL|SSCR1_ECRA|macro|SSCR1_ECRA
DECL|SSCR1_ECRB|macro|SSCR1_ECRB
DECL|SSCR1_EFWR|macro|SSCR1_EFWR
DECL|SSCR1_IFS|macro|SSCR1_IFS
DECL|SSCR1_LBM|macro|SSCR1_LBM
DECL|SSCR1_MWDS|macro|SSCR1_MWDS
DECL|SSCR1_PINTE|macro|SSCR1_PINTE
DECL|SSCR1_RIE|macro|SSCR1_RIE
DECL|SSCR1_RSRE|macro|SSCR1_RSRE
DECL|SSCR1_RWOT|macro|SSCR1_RWOT
DECL|SSCR1_SCFR|macro|SSCR1_SCFR
DECL|SSCR1_SCLKDIR|macro|SSCR1_SCLKDIR
DECL|SSCR1_SFRMDIR|macro|SSCR1_SFRMDIR
DECL|SSCR1_SPH|macro|SSCR1_SPH
DECL|SSCR1_SPO|macro|SSCR1_SPO
DECL|SSCR1_STRF|macro|SSCR1_STRF
DECL|SSCR1_TIE|macro|SSCR1_TIE
DECL|SSCR1_TINTE|macro|SSCR1_TINTE
DECL|SSCR1_TRAIL|macro|SSCR1_TRAIL
DECL|SSCR1_TSRE|macro|SSCR1_TSRE
DECL|SSCR1_TTELP|macro|SSCR1_TTELP
DECL|SSCR1_TTE|macro|SSCR1_TTE
DECL|SSCR2_LJDFD|macro|SSCR2_LJDFD
DECL|SSCR2_SDFD|macro|SSCR2_SDFD
DECL|SSCR2_SDPM|macro|SSCR2_SDPM
DECL|SSCR2_TURM1|macro|SSCR2_TURM1
DECL|SSCR3_RFL_MASK|macro|SSCR3_RFL_MASK
DECL|SSCR3_RFT_MASK|macro|SSCR3_RFT_MASK
DECL|SSCR3_RX|macro|SSCR3_RX
DECL|SSCR3_TFL_MASK|macro|SSCR3_TFL_MASK
DECL|SSCR3_TFT_MASK|macro|SSCR3_TFT_MASK
DECL|SSCR3_TX|macro|SSCR3_TX
DECL|SSIOC_SCOE|macro|SSIOC_SCOE
DECL|SSIOC_SFCR|macro|SSIOC_SFCR
DECL|SSIOC_TXDPDEB|macro|SSIOC_TXDPDEB
DECL|SSPSP_DMYSTOP|macro|SSPSP_DMYSTOP
DECL|SSPSP_DMYSTRT|macro|SSPSP_DMYSTRT
DECL|SSPSP_EDMYSTOP|macro|SSPSP_EDMYSTOP
DECL|SSPSP_ETDS|macro|SSPSP_ETDS
DECL|SSPSP_FSRT|macro|SSPSP_FSRT
DECL|SSPSP_SCMODE|macro|SSPSP_SCMODE
DECL|SSPSP_SFRMDLY|macro|SSPSP_SFRMDLY
DECL|SSPSP_SFRMP|macro|SSPSP_SFRMP
DECL|SSPSP_SFRMWDTH|macro|SSPSP_SFRMWDTH
DECL|SSPSP_STRTDLY|macro|SSPSP_STRTDLY
DECL|SSRSA_RTSA|macro|SSRSA_RTSA
DECL|SSRSA_RXEN|macro|SSRSA_RXEN
DECL|SSSR_BSY|macro|SSSR_BSY
DECL|SSSR_RFS|macro|SSSR_RFS
DECL|SSSR_RNE|macro|SSSR_RNE
DECL|SSSR_ROR|macro|SSSR_ROR
DECL|SSSR_TFS|macro|SSSR_TFS
DECL|SSSR_TNF|macro|SSSR_TNF
DECL|SSTSA_TTSA|macro|SSTSA_TTSA
DECL|SSTSA_TXEN|macro|SSTSA_TXEN
DECL|_I2S_CAVS_H_|macro|_I2S_CAVS_H_
DECL|i2s_cavs_mn_div|struct|struct i2s_cavs_mn_div {
DECL|i2s_cavs_ssp|struct|struct i2s_cavs_ssp {
DECL|mval|member|u32_t mval; /* 0x00 - M value */
DECL|nval|member|u32_t nval; /* 0x04 - N value */
DECL|reserved0|member|u32_t reserved0[5];
DECL|reserved1|member|u32_t reserved1;
DECL|ssc0|member|u32_t ssc0; /* 0x00 - Control0 */
DECL|ssc1|member|u32_t ssc1; /* 0x04 - Control1 */
DECL|ssc2|member|u32_t ssc2; /* 0x40 - Command / Status 2 */
DECL|ssc3|member|u32_t ssc3; /* 0x48 - Command / Status 3 */
DECL|ssd|member|u32_t ssd; /* 0x10 - Data */
DECL|ssioc|member|u32_t ssioc; /* 0x4C - IO Control */
DECL|ssit|member|u32_t ssit; /* 0x0C - Interrupt Test */
DECL|sspsp2|member|u32_t sspsp2; /* 0x44 - Programmable Serial Protocol 2 */
DECL|sspsp|member|u32_t sspsp; /* 0x2C - Programmable Serial Protocol */
DECL|ssrsa|member|u32_t ssrsa; /* 0x34 - RX Time Slot Active */
DECL|sss|member|u32_t sss; /* 0x08 - Status */
DECL|ssto|member|u32_t ssto; /* 0x28 - Time Out */
DECL|sstsa|member|u32_t sstsa; /* 0x30 - TX Time Slot Active */
DECL|sstss|member|u32_t sstss; /* 0x38 - Time Slot Status */
